# tuple
my_tuple = (1, 2, 3, 4, 5)
print(my_tuple)  # Output: (1, 2, 3, 4, 5)
print(my_tuple[0])  # Output: 1 (доступ до першого елемента)
print(my_tuple[1:4])  # Output: (2, 3, 4) (доступ до зрізу з другого по четвертий елемент)
print(len(my_tuple))  # Output: 5 (довжина кортежу)

# Кортежі є незмінними, тому наступні операції викличуть помилки:
# my_tuple[0] = 10  # Це викличе помилку, оскільки кортежі не підтримують зміну елементів
# my_tuple.append(6)  # Це викличе помилку, оскільки кортежі не підтримують додавання елементів
# my_tuple.remove(3)  # Це викличе помилку, оскільки кортежі не підтримують видалення елементів

# Кортежі можуть містити різні типи даних
mixed_tuple = (1, "Hello", 3.14, [1, 2, 3], (4, 5))
print(mixed_tuple)  # Output: (1, 'Hello', 3.14, [1, 2, 3], (4, 5))

#Кортежі з одним елементом
single_element_tuple = (42,)
print(single_element_tuple)  # Output: (42,) (кортеж з одним елементом повинен містити кому)
not_a_tuple = (42)
print(not_a_tuple)  # Output: 42 (це не кортеж, а просто число, оскільки відсутня кома)
# Python використовує круглі дужки як математичні символи. Якщо написати вираз на кшталт my_tuple = (1), виникає невизначеність.

# Кортеж можна створити без дужок, ця операція називається упакування кортежу:

packed_tuple = 1, 2, 3, 4, 5
print(packed_tuple)  # Output: (1, 2, 3, 4, 5) (кортеж створений без дужок)

# набір точок на площині (кортежі). Їх можна використовувати як ключі у словнику:
point1 = (2, 3)
point2 = (5, 7)
points_dict = {point1: "A", point2: "B"}
print(points_dict)  # Output: {(2, 3): 'A', (5, 7): 'B'} (кортежі використовуються як ключі у словнику)


