"""
Основні компоненти регулярних виразів включають:

1. Літерали. Пряме відображення символів (наприклад, a, B, 1).
2. Метасимволи. Символи, які мають спеціальне значення в регулярних виразах (наприклад, . (крапка) відповідає будь-якому символу).
3. Квантифікатори. Визначають, скільки разів елемент повинен відповідати (наприклад * означає 0 або більше повторень).
4. Класи символів. Визначають групи символів (наприклад, [a-z] відповідає будь-якій малій літері).
5. Групи та діапазони. Використовуються для групування частин виразу (наприклад, (abc) визначає групу символів).
6. Альтернації. Відповідає одному з декількох шаблонів (наприклад, a|b відповідає a або b).
7. Якорі. Визначають позиції у тексті (наприклад, ^ для початку рядка, $ для кінця рядка).

Для роботи з регулярними виразами в Python використовується модуль re.
Основні функції модуля re які ми розглянемо далі це:

re.search(pattern, string) виконує пошук першого входження шаблону в рядку.
re.findall(pattern, string) виконує знаходження всіх входжень шаблону в рядку.
re.sub(pattern, repl, string) виконує заміну входжень шаблону на інший рядок.
re.split(pattern, string) виконує розбивання рядка за шаблоном.

Основне завдання регулярних виразів — це пошук рядка, або підрядка, який відповідає опису в термінах регулярних виразів.

Використовуючи цей механізм можна робити наступні операції:

- перевіряти, що рядок відповідає деяким вимогам (наприклад, номер телефону або email);
- розділяти рядки на підрядки за деяким виразом (розбити текст на речення, використовуючи усі розділові знаки, а не тільки якийсь один);
- замінювати підрядок в рядку (замінити усі слова, що починаються на деяку послідовність);
- знаходити підрядок в рядку, який відповідає виразу.

Прикладом блоку може бути:

\w — будь-яка цифра або буква [a-zA-Z0-9_] (\W — все, крім букви або цифри [^a-za-z0-9_])
\d — будь-яка цифра [0-9] (\D — усе, крім цифри [^0-9])
\s — будь-який пробільний символ [\t\n\r\f\v] (\S — усе, крім пробільних символів [^\t\n\r\f\v])
\b — межа слова
[...] — один із символів у дужках ([^ ] — будь-який символ, крім тих, що в дужках)
^ і $ — початок і кінець рядка відповідно
( ) — групує вираз і повертає знайдений текст
\t, \n, \r — символ табуляції, нового рядка та повернення каретки

Модифікатори можуть вказувати на кількість повторень блоку у виразі, наприклад:

. — один будь-який символ, крім рядка \n
? — 0 або 1 входження шаблону зліва
+ — 1 і більше входжень шаблону зліва
* — 0 і більше входжень шаблону зліва
\ — екранування спец.символів (приклад: \. — означає крапку або \+ — знак «плюс»)
{n} суворо n разів (n ціле число)
{n,m} — від n до m входжень (приклад: {,m} — від 0 до m)
a|b — відповідає a або b. Сам символ | означає «або» між двома шаблонами
( ) — групує вираз і повертає знайдений текст

Method search:

Результат виконання re.search() — це спеціальний об'єкт Match, якщо знаходить відповідність. Якщо відповідність не знайдена, повертає None.

Об'єкт Match має властивості та методи, що використовуються для отримання інформації про пошук та результат:

Match.span() повертає кортеж, що містить початкову та кінцеву позиції збігу.
Match.string повертає рядок, переданий у функцію,
Match.group() повертає частину рядка, в якому був збіг

Ви можете використати метод .group() у цьому об'єкті, щоб отримати відповідну частину рядка.

"""

import re
text = "Вивчення Python може бути веселим."
pattern = "Python"
match = re.search(pattern, text)

if match:
    print("Знайдено:", match.group())
else:
    print("Не знайдено.")
