# tuple
my_tuple = (1, 2, 3, 4, 5)
print(my_tuple)  # Output: (1, 2, 3, 4, 5)
print(my_tuple[0])  # Output: 1 (доступ до першого елемента)
print(my_tuple[1:4])  # Output: (2, 3, 4) (доступ до зрізу з другого по четвертий елемент)
print(len(my_tuple))  # Output: 5 (довжина кортежу)

# Порядок елементів у кортежі важливий, тому (1, 2, 3) і (3, 2, 1) - це різні кортежі.
# Індексація в кортежах починається з 0, тому перший елемент має індекс 0, другий - індекс 1 і так далі.
# Кортежі підтримують негативну індексацію, де -1 - це останній елемент, -2 - передостанній і так далі.
print(my_tuple[-1])  # Output: 5 (останній елемент)
print(my_tuple[-2])  # Output: 4 (передостанній елемент)
# Кортежі підтримують вкладені структури, тому можна створювати кортежі всередині інших кортежів.
nested_tuple = (1, 2, (3, 4), 5)
print(nested_tuple)  # Output: (1, 2, (3, 4), 5) (кортеж, що містить інший кортеж)
print(nested_tuple[2])  # Output: (3, 4) (доступ до вкладеного кортежу)
print(nested_tuple[2][0])  # Output: 3 (доступ до першого елемента вкладеного кортежу)


# Кортежі є незмінними, тому наступні операції викличуть помилки:
# my_tuple[0] = 10  # Це викличе помилку, оскільки кортежі не підтримують зміну елементів
# my_tuple.append(6)  # Це викличе помилку, оскільки кортежі не підтримують додавання елементів
# my_tuple.remove(3)  # Це викличе помилку, оскільки кортежі не підтримують видалення елементів

# Кортежі можуть містити різні типи даних
mixed_tuple = (1, "Hello", 3.14, [1, 2, 3], (4, 5))
print(mixed_tuple)  # Output: (1, 'Hello', 3.14, [1, 2, 3], (4, 5))

#Кортежі з одним елементом
single_element_tuple = (42,)
print(single_element_tuple)  # Output: (42,) (кортеж з одним елементом повинен містити кому)
not_a_tuple = (42)
print(not_a_tuple)  # Output: 42 (це не кортеж, а просто число, оскільки відсутня кома)
# Python використовує круглі дужки як математичні символи. Якщо написати вираз на кшталт my_tuple = (1), виникає невизначеність.

# Кортеж можна створити без дужок, ця операція називається упакування кортежу:

packed_tuple = 1, 2, 3, 4, 5
print(packed_tuple)  # Output: (1, 2, 3, 4, 5) (кортеж створений без дужок)

# набір точок на площині (кортежі). Їх можна використовувати як ключі у словнику:
point1 = (2, 3)
point2 = (5, 7)
points_dict = {point1: "A", point2: "B"}
print(points_dict)  # Output: {(2, 3): 'A', (5, 7): 'B'} (кортежі використовуються як ключі у словнику)


